espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_CMD_LUT2_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT2_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x248)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE2 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 2.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE2    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE2_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE2_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE2_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE2_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE2_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN2 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 2.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN2    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN2_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN2_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN2_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN2_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN2_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN2 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 2.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN2    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN2_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN2_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN2_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN2_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN2_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN2 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 2.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN2    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN2_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN2_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN2_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN2_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN2_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN2 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 2.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN2    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN2_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN2_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN2_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN2_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN2_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN2 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 2,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT2_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN2    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN2_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN2_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN2_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN2_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN2_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT3_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT3_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x24c)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE3 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 3.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE3    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE3_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE3_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE3_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE3_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE3_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN3 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 3.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN3    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN3_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN3_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN3_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN3_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN3_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN3 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 3.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN3    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN3_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN3_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN3_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN3_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN3_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN3 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 3.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN3    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN3_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN3_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN3_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN3_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN3_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN3 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 3.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN3    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN3_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN3_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN3_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN3_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN3_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN3 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 3,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT3_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN3    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN3_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN3_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN3_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN3_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN3_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT4_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT4_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x250)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE4 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 4.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE4    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE4_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE4_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE4_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE4_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE4_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN4 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 4.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN4    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN4_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN4_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN4_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN4_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN4_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN4 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 4.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN4    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN4_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN4_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN4_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN4_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN4_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN4 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 4.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN4    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN4_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN4_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN4_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN4_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN4_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN4 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 4.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN4    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN4_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN4_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN4_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN4_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN4_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN4 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 4,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT4_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN4    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN4_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN4_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN4_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN4_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN4_S  30

