espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_CMD_LUT5_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT5_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x254)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE5 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 5.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE5    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE5_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE5_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE5_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE5_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE5_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN5 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 5.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN5    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN5_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN5_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN5_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN5_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN5_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN5 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 5.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN5    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN5_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN5_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN5_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN5_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN5_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN5 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 5.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN5    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN5_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN5_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN5_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN5_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN5_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN5 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 5.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN5    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN5_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN5_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN5_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN5_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN5_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN5 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 5,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT5_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN5    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN5_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN5_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN5_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN5_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN5_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT6_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT6_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x258)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE6 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 6.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE6    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE6_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE6_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE6_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE6_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE6_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN6 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 6.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN6    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN6_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN6_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN6_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN6_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN6_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN6 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 6.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN6    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN6_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN6_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN6_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN6_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN6_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN6 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 6.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN6    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN6_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN6_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN6_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN6_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN6_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN6 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 6.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN6    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN6_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN6_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN6_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN6_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN6_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN6 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 6,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT6_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN6    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN6_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN6_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN6_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN6_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN6_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT7_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT7_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x25c)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE7 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 7.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE7    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE7_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE7_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE7_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE7_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE7_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN7 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 7.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN7    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN7_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN7_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN7_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN7_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN7_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN7 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 7.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN7    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN7_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN7_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN7_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN7_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN7_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN7 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 7.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN7    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN7_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN7_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN7_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN7_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN7_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN7 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 7.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN7    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN7_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN7_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN7_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN7_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN7_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN7 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 7,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT7_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN7    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN7_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN7_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN7_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN7_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN7_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT8_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT8_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x260)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE8 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 8.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE8    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE8_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE8_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE8_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE8_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE8_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN8 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 8.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN8    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN8_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN8_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN8_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN8_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN8_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN8 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 8.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN8    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN8_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN8_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN8_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN8_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN8_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN8 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 8.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN8    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN8_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN8_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN8_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN8_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN8_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN8 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 8.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN8    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN8_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN8_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN8_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN8_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN8_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN8 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 8,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT8_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN8    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN8_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN8_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN8_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN8_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN8_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT9_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT9_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x264)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE9 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 9.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE9    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE9_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE9_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE9_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE9_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE9_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN9 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 9.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN9    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN9_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN9_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN9_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN9_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN9_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN9 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 9.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN9    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN9_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN9_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN9_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN9_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN9_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN9 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 9.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN9    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN9_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN9_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN9_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN9_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN9_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN9 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 9.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN9    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN9_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN9_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN9_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN9_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN9_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN9 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 9,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT9_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN9    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN9_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN9_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN9_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN9_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN9_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT10_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT10_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x268)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE10 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 10.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE10    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE10_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE10_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE10_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE10_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE10_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN10 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 10.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN10    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN10_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN10_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN10_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN10_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN10_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN10 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 10.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN10    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN10_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN10_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN10_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN10_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN10_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN10 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 10.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN10    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN10_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN10_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN10_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN10_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN10_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN10 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 10.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN10    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN10_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN10_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN10_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN10_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN10_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN10 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 10,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_CMD_LUT10_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN10    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN10_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN10_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN10_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN10_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN10_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT11_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT11_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x26c)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE11 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 11.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE11    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE11_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE11_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE11_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE11_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE11_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN11 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 11.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN11    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN11_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN11_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN11_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN11_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN11_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN11 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 11.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN11    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN11_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN11_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN11_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN11_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN11_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN11 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 11.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN11    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN11_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN11_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN11_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN11_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN11_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN11 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 11.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN11    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN11_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN11_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN11_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN11_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN11_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN11 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 11,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_CMD_LUT11_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN11    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN11_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN11_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN11_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN11_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN11_S  30

