espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_CMD_LUT12_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT12_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x270)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE12 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 12.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE12    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE12_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE12_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE12_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE12_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE12_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN12 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 12.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN12    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN12_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN12_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN12_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN12_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN12_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN12 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 12.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN12    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN12_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN12_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN12_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN12_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN12_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN12 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 12.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN12    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN12_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN12_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN12_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN12_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN12_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN12 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 12.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN12    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN12_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN12_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN12_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN12_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN12_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN12 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 12,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_CMD_LUT12_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN12    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN12_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN12_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN12_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN12_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN12_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT13_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT13_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x274)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 13.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 13.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN13 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 13.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN13    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN13_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN13_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN13_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN13_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN13_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 13.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN13 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 13.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN13    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN13_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN13_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN13_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN13_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN13_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN13 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 13,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_CMD_LUT13_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN13    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN13_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN13_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN13_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN13_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN13_S  30

/** SPI_MEM_NAND_FLASH_CMD_LUT14_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT14_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x278)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 14.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 14.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN14 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 14.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN14    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN14_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN14_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN14_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN14_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN14_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 14.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN14 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 14.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN14    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN14_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN14_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN14_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN14_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN14_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN14 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 14,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_CMD_LUT14_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN14    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN14_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN14_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN14_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN14_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN14_S  30

