espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_CMD_LUT15_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_NAND_FLASH_CMD_LUT15_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x27c)
/** SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 15.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15    0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15_M  (SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15_V << SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15_V  0x0000FFFFU
#define SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15_S  0
/** SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 15.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15_M  (SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15_V << SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15_S)
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15_S  16
/** SPI_MEM_NAND_FLASH_LUT_CMD_LEN15 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 15.
 */
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN15    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN15_M  (SPI_MEM_NAND_FLASH_LUT_CMD_LEN15_V << SPI_MEM_NAND_FLASH_LUT_CMD_LEN15_S)
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN15_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_CMD_LEN15_S  20
/** SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 15.
 */
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15    0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15_M  (SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15_V << SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15_S)
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15_S  24
/** SPI_MEM_NAND_FLASH_LUT_DATA_LEN15 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 15.
 */
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN15    0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN15_M  (SPI_MEM_NAND_FLASH_LUT_DATA_LEN15_V << SPI_MEM_NAND_FLASH_LUT_DATA_LEN15_S)
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN15_V  0x00000003U
#define SPI_MEM_NAND_FLASH_LUT_DATA_LEN15_S  28
/** SPI_MEM_NAND_FLASH_LUT_BUS_EN15 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 15,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_CMD_LUT15_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN15    (BIT(30))
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN15_M  (SPI_MEM_NAND_FLASH_LUT_BUS_EN15_V << SPI_MEM_NAND_FLASH_LUT_BUS_EN15_S)
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN15_V  0x00000001U
#define SPI_MEM_NAND_FLASH_LUT_BUS_EN15_S  30

/** SPI_MEM_NAND_FLASH_SPI_SEQ0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ0_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x280)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN0 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN0    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN0_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN0_V << SPI_MEM_NAND_FLASH_SR_CHK_EN0_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN0_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN0_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX0 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 0.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX0    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX0_M  (SPI_MEM_NAND_FLASH_DIN_INDEX0_V << SPI_MEM_NAND_FLASH_DIN_INDEX0_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX0_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX0_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX0 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 0.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX0    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX0_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX0_V << SPI_MEM_NAND_FLASH_ADDR_INDEX0_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX0_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX0_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG0 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG0    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG0_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG0_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG0_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG0_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG0_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX0 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX0    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX0_M  (SPI_MEM_NAND_FLASH_CMD_INDEX0_V << SPI_MEM_NAND_FLASH_CMD_INDEX0_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX0_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX0_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ1_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ1_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x284)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 1.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN1 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 1. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN1    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN1_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN1_V << SPI_MEM_NAND_FLASH_SR_CHK_EN1_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN1_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN1_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX1 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 1.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX1    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX1_M  (SPI_MEM_NAND_FLASH_DIN_INDEX1_V << SPI_MEM_NAND_FLASH_DIN_INDEX1_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX1_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX1_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX1 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 1.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX1    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX1_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX1_V << SPI_MEM_NAND_FLASH_ADDR_INDEX1_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX1_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX1_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG1 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 1. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG1    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG1_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG1_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG1_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG1_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG1_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX1 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 1. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX1    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX1_M  (SPI_MEM_NAND_FLASH_CMD_INDEX1_V << SPI_MEM_NAND_FLASH_CMD_INDEX1_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX1_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX1_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ2_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ2_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x288)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 2.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN2 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 2. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN2    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN2_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN2_V << SPI_MEM_NAND_FLASH_SR_CHK_EN2_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN2_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN2_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX2 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 2.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX2    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX2_M  (SPI_MEM_NAND_FLASH_DIN_INDEX2_V << SPI_MEM_NAND_FLASH_DIN_INDEX2_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX2_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX2_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX2 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 2.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX2    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX2_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX2_V << SPI_MEM_NAND_FLASH_ADDR_INDEX2_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX2_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX2_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG2 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 2. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG2    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG2_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG2_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG2_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG2_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG2_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX2 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 2. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX2    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX2_M  (SPI_MEM_NAND_FLASH_CMD_INDEX2_V << SPI_MEM_NAND_FLASH_CMD_INDEX2_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX2_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX2_S  11

