espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_SPI_SEQ3_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ3_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x28c)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 3.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN3 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 3. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN3    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN3_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN3_V << SPI_MEM_NAND_FLASH_SR_CHK_EN3_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN3_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN3_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX3 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 3.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX3    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX3_M  (SPI_MEM_NAND_FLASH_DIN_INDEX3_V << SPI_MEM_NAND_FLASH_DIN_INDEX3_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX3_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX3_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX3 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 3.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX3    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX3_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX3_V << SPI_MEM_NAND_FLASH_ADDR_INDEX3_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX3_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX3_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG3 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 3. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG3    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG3_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG3_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG3_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG3_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG3_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX3 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 3. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX3    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX3_M  (SPI_MEM_NAND_FLASH_CMD_INDEX3_V << SPI_MEM_NAND_FLASH_CMD_INDEX3_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX3_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX3_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ4_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ4_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x290)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 4.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN4 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 4. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN4    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN4_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN4_V << SPI_MEM_NAND_FLASH_SR_CHK_EN4_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN4_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN4_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX4 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 4.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX4    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX4_M  (SPI_MEM_NAND_FLASH_DIN_INDEX4_V << SPI_MEM_NAND_FLASH_DIN_INDEX4_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX4_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX4_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX4 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 4.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX4    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX4_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX4_V << SPI_MEM_NAND_FLASH_ADDR_INDEX4_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX4_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX4_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG4 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 4. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG4    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG4_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG4_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG4_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG4_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG4_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX4 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 4. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX4    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX4_M  (SPI_MEM_NAND_FLASH_CMD_INDEX4_V << SPI_MEM_NAND_FLASH_CMD_INDEX4_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX4_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX4_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ5_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ5_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x294)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 5.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN5 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 5. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN5    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN5_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN5_V << SPI_MEM_NAND_FLASH_SR_CHK_EN5_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN5_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN5_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX5 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 5.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX5    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX5_M  (SPI_MEM_NAND_FLASH_DIN_INDEX5_V << SPI_MEM_NAND_FLASH_DIN_INDEX5_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX5_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX5_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX5 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 5.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX5    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX5_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX5_V << SPI_MEM_NAND_FLASH_ADDR_INDEX5_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX5_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX5_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG5 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 5. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG5    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG5_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG5_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG5_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG5_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG5_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX5 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 5. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX5    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX5_M  (SPI_MEM_NAND_FLASH_CMD_INDEX5_V << SPI_MEM_NAND_FLASH_CMD_INDEX5_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX5_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX5_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ6_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ6_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x298)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 6.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN6 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 6. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN6    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN6_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN6_V << SPI_MEM_NAND_FLASH_SR_CHK_EN6_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN6_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN6_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX6 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 6.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX6    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX6_M  (SPI_MEM_NAND_FLASH_DIN_INDEX6_V << SPI_MEM_NAND_FLASH_DIN_INDEX6_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX6_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX6_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX6 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 6.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX6    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX6_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX6_V << SPI_MEM_NAND_FLASH_ADDR_INDEX6_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX6_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX6_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG6 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 6. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG6    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG6_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG6_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG6_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG6_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG6_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX6 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 6. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX6    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX6_M  (SPI_MEM_NAND_FLASH_CMD_INDEX6_V << SPI_MEM_NAND_FLASH_CMD_INDEX6_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX6_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX6_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ7_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ7_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x29c)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 7.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN7 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 7. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN7    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN7_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN7_V << SPI_MEM_NAND_FLASH_SR_CHK_EN7_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN7_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN7_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX7 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 7.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX7    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX7_M  (SPI_MEM_NAND_FLASH_DIN_INDEX7_V << SPI_MEM_NAND_FLASH_DIN_INDEX7_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX7_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX7_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX7 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 7.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX7    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX7_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX7_V << SPI_MEM_NAND_FLASH_ADDR_INDEX7_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX7_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX7_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG7 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 7. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG7    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG7_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG7_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG7_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG7_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG7_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX7 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 7. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX7    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX7_M  (SPI_MEM_NAND_FLASH_CMD_INDEX7_V << SPI_MEM_NAND_FLASH_CMD_INDEX7_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX7_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX7_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ8_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ8_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2a0)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 8.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN8 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 8. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN8    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN8_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN8_V << SPI_MEM_NAND_FLASH_SR_CHK_EN8_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN8_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN8_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX8 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 8.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX8    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX8_M  (SPI_MEM_NAND_FLASH_DIN_INDEX8_V << SPI_MEM_NAND_FLASH_DIN_INDEX8_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX8_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX8_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX8 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 8.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX8    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX8_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX8_V << SPI_MEM_NAND_FLASH_ADDR_INDEX8_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX8_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX8_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG8 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 8. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG8    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG8_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG8_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG8_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG8_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG8_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX8 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 8. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX8    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX8_M  (SPI_MEM_NAND_FLASH_CMD_INDEX8_V << SPI_MEM_NAND_FLASH_CMD_INDEX8_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX8_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX8_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ9_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ9_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2a4)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 9.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN9 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 9. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN9    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN9_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN9_V << SPI_MEM_NAND_FLASH_SR_CHK_EN9_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN9_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN9_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX9 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 9.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX9    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX9_M  (SPI_MEM_NAND_FLASH_DIN_INDEX9_V << SPI_MEM_NAND_FLASH_DIN_INDEX9_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX9_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX9_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX9 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 9.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX9    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX9_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX9_V << SPI_MEM_NAND_FLASH_ADDR_INDEX9_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX9_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX9_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG9 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 9. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG9    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG9_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG9_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG9_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG9_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG9_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX9 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 9. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX9    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX9_M  (SPI_MEM_NAND_FLASH_CMD_INDEX9_V << SPI_MEM_NAND_FLASH_CMD_INDEX9_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX9_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX9_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ10_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ10_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2a8)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 10.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN10 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 10. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN10    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN10_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN10_V << SPI_MEM_NAND_FLASH_SR_CHK_EN10_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN10_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN10_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX10 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 10.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX10    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX10_M  (SPI_MEM_NAND_FLASH_DIN_INDEX10_V << SPI_MEM_NAND_FLASH_DIN_INDEX10_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX10_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX10_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX10 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 10.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX10    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX10_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX10_V << SPI_MEM_NAND_FLASH_ADDR_INDEX10_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX10_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX10_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG10 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 10. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG10    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG10_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG10_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG10_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG10_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG10_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX10 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 10. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX10    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX10_M  (SPI_MEM_NAND_FLASH_CMD_INDEX10_V << SPI_MEM_NAND_FLASH_CMD_INDEX10_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX10_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX10_S  11

