espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_SPI_SEQ11_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ11_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2ac)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 11.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN11 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 11. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN11    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN11_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN11_V << SPI_MEM_NAND_FLASH_SR_CHK_EN11_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN11_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN11_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX11 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 11.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX11    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX11_M  (SPI_MEM_NAND_FLASH_DIN_INDEX11_V << SPI_MEM_NAND_FLASH_DIN_INDEX11_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX11_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX11_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX11 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 11.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX11    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX11_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX11_V << SPI_MEM_NAND_FLASH_ADDR_INDEX11_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX11_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX11_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG11 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 11. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG11    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG11_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG11_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG11_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG11_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG11_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX11 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 11. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX11    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX11_M  (SPI_MEM_NAND_FLASH_CMD_INDEX11_V << SPI_MEM_NAND_FLASH_CMD_INDEX11_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX11_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX11_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ12_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ12_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2b0)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 12.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN12 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 12. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN12    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN12_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN12_V << SPI_MEM_NAND_FLASH_SR_CHK_EN12_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN12_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN12_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX12 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 12.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX12    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX12_M  (SPI_MEM_NAND_FLASH_DIN_INDEX12_V << SPI_MEM_NAND_FLASH_DIN_INDEX12_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX12_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX12_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX12 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 12.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX12    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX12_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX12_V << SPI_MEM_NAND_FLASH_ADDR_INDEX12_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX12_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX12_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG12 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 12. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG12    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG12_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG12_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG12_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG12_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG12_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX12 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 12. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX12    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX12_M  (SPI_MEM_NAND_FLASH_CMD_INDEX12_V << SPI_MEM_NAND_FLASH_CMD_INDEX12_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX12_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX12_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ13_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ13_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2b4)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 13.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN13 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 13. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN13    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN13_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN13_V << SPI_MEM_NAND_FLASH_SR_CHK_EN13_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN13_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN13_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX13 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 13.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX13    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX13_M  (SPI_MEM_NAND_FLASH_DIN_INDEX13_V << SPI_MEM_NAND_FLASH_DIN_INDEX13_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX13_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX13_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX13 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 13.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX13    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX13_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX13_V << SPI_MEM_NAND_FLASH_ADDR_INDEX13_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX13_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX13_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG13 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 13. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG13    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG13_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG13_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG13_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG13_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG13_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX13 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 13. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX13    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX13_M  (SPI_MEM_NAND_FLASH_CMD_INDEX13_V << SPI_MEM_NAND_FLASH_CMD_INDEX13_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX13_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX13_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ14_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ14_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2b8)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 14.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN14 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 14. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN14    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN14_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN14_V << SPI_MEM_NAND_FLASH_SR_CHK_EN14_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN14_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN14_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX14 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 14.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX14    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX14_M  (SPI_MEM_NAND_FLASH_DIN_INDEX14_V << SPI_MEM_NAND_FLASH_DIN_INDEX14_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX14_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX14_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX14 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 14.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX14    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX14_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX14_V << SPI_MEM_NAND_FLASH_ADDR_INDEX14_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX14_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX14_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG14 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 14. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG14    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG14_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG14_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG14_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG14_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG14_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX14 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 14. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX14    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX14_M  (SPI_MEM_NAND_FLASH_CMD_INDEX14_V << SPI_MEM_NAND_FLASH_CMD_INDEX14_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX14_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX14_S  11

