espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_SPI_SEQ15_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ15_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2bc)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG15 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 15.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG15    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG15_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG15_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG15_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG15_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG15_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN15 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 15. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN15    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN15_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN15_V << SPI_MEM_NAND_FLASH_SR_CHK_EN15_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN15_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN15_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX15 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 15.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX15    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX15_M  (SPI_MEM_NAND_FLASH_DIN_INDEX15_V << SPI_MEM_NAND_FLASH_DIN_INDEX15_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX15_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX15_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX15 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 15.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX15    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX15_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX15_V << SPI_MEM_NAND_FLASH_ADDR_INDEX15_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX15_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX15_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG15 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 15. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG15    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG15_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG15_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG15_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG15_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG15_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX15 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 15. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX15    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX15_M  (SPI_MEM_NAND_FLASH_CMD_INDEX15_V << SPI_MEM_NAND_FLASH_CMD_INDEX15_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX15_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX15_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ16_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ16_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2c0)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG16 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 16.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG16    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG16_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG16_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG16_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG16_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG16_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN16 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 16. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN16    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN16_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN16_V << SPI_MEM_NAND_FLASH_SR_CHK_EN16_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN16_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN16_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX16 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 16.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX16    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX16_M  (SPI_MEM_NAND_FLASH_DIN_INDEX16_V << SPI_MEM_NAND_FLASH_DIN_INDEX16_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX16_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX16_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX16 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 16.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX16    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX16_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX16_V << SPI_MEM_NAND_FLASH_ADDR_INDEX16_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX16_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX16_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG16 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 16. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG16    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG16_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG16_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG16_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG16_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG16_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX16 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 16. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX16    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX16_M  (SPI_MEM_NAND_FLASH_CMD_INDEX16_V << SPI_MEM_NAND_FLASH_CMD_INDEX16_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX16_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX16_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ17_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ17_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2c4)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG17 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 17.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG17    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG17_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG17_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG17_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG17_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG17_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN17 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 17. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN17    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN17_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN17_V << SPI_MEM_NAND_FLASH_SR_CHK_EN17_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN17_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN17_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX17 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 17.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX17    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX17_M  (SPI_MEM_NAND_FLASH_DIN_INDEX17_V << SPI_MEM_NAND_FLASH_DIN_INDEX17_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX17_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX17_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX17 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 17.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX17    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX17_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX17_V << SPI_MEM_NAND_FLASH_ADDR_INDEX17_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX17_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX17_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG17 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 17. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG17    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG17_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG17_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG17_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG17_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG17_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX17 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 17. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX17    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX17_M  (SPI_MEM_NAND_FLASH_CMD_INDEX17_V << SPI_MEM_NAND_FLASH_CMD_INDEX17_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX17_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX17_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ18_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ18_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2c8)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG18 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 18.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG18    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG18_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG18_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG18_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG18_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG18_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN18 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 18. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN18    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN18_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN18_V << SPI_MEM_NAND_FLASH_SR_CHK_EN18_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN18_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN18_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX18 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 18.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX18    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX18_M  (SPI_MEM_NAND_FLASH_DIN_INDEX18_V << SPI_MEM_NAND_FLASH_DIN_INDEX18_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX18_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX18_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX18 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 18.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX18    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX18_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX18_V << SPI_MEM_NAND_FLASH_ADDR_INDEX18_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX18_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX18_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG18 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 18. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG18    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG18_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG18_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG18_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG18_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG18_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX18 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 18. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX18    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX18_M  (SPI_MEM_NAND_FLASH_CMD_INDEX18_V << SPI_MEM_NAND_FLASH_CMD_INDEX18_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX18_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX18_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ19_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ19_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2cc)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG19 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 19.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG19    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG19_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG19_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG19_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG19_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG19_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN19 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 19. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN19    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN19_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN19_V << SPI_MEM_NAND_FLASH_SR_CHK_EN19_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN19_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN19_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX19 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 19.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX19    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX19_M  (SPI_MEM_NAND_FLASH_DIN_INDEX19_V << SPI_MEM_NAND_FLASH_DIN_INDEX19_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX19_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX19_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX19 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 19.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX19    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX19_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX19_V << SPI_MEM_NAND_FLASH_ADDR_INDEX19_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX19_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX19_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG19 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 19. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG19    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG19_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG19_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG19_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG19_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG19_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX19 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 19. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX19    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX19_M  (SPI_MEM_NAND_FLASH_CMD_INDEX19_V << SPI_MEM_NAND_FLASH_CMD_INDEX19_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX19_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX19_S  11

