espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_SPI_SEQ20_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ20_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2d0)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG20 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 20.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG20    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG20_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG20_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG20_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG20_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG20_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN20 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 20. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN20    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN20_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN20_V << SPI_MEM_NAND_FLASH_SR_CHK_EN20_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN20_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN20_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX20 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 20.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX20    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX20_M  (SPI_MEM_NAND_FLASH_DIN_INDEX20_V << SPI_MEM_NAND_FLASH_DIN_INDEX20_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX20_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX20_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX20 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 20.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX20    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX20_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX20_V << SPI_MEM_NAND_FLASH_ADDR_INDEX20_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX20_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX20_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG20 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 20. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG20    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG20_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG20_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG20_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG20_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG20_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX20 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 20. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX20    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX20_M  (SPI_MEM_NAND_FLASH_CMD_INDEX20_V << SPI_MEM_NAND_FLASH_CMD_INDEX20_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX20_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX20_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ21_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ21_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2d4)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG21 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 21.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG21    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG21_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG21_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG21_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG21_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG21_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN21 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 21. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN21    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN21_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN21_V << SPI_MEM_NAND_FLASH_SR_CHK_EN21_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN21_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN21_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX21 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 21.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX21    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX21_M  (SPI_MEM_NAND_FLASH_DIN_INDEX21_V << SPI_MEM_NAND_FLASH_DIN_INDEX21_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX21_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX21_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX21 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 21.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX21    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX21_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX21_V << SPI_MEM_NAND_FLASH_ADDR_INDEX21_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX21_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX21_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG21 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 21. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG21    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG21_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG21_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG21_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG21_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG21_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX21 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 21. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX21    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX21_M  (SPI_MEM_NAND_FLASH_CMD_INDEX21_V << SPI_MEM_NAND_FLASH_CMD_INDEX21_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX21_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX21_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ22_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ22_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2d8)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG22 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 22.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG22    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG22_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG22_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG22_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG22_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG22_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN22 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 22. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN22    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN22_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN22_V << SPI_MEM_NAND_FLASH_SR_CHK_EN22_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN22_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN22_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX22 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 22.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX22    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX22_M  (SPI_MEM_NAND_FLASH_DIN_INDEX22_V << SPI_MEM_NAND_FLASH_DIN_INDEX22_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX22_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX22_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX22 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 22.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX22    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX22_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX22_V << SPI_MEM_NAND_FLASH_ADDR_INDEX22_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX22_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX22_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG22 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 22. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG22    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG22_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG22_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG22_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG22_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG22_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX22 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 22. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX22    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX22_M  (SPI_MEM_NAND_FLASH_CMD_INDEX22_V << SPI_MEM_NAND_FLASH_CMD_INDEX22_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX22_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX22_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ23_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ23_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2dc)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG23 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 23.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG23    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG23_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG23_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG23_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG23_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG23_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN23 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 23. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN23    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN23_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN23_V << SPI_MEM_NAND_FLASH_SR_CHK_EN23_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN23_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN23_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX23 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 23.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX23    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX23_M  (SPI_MEM_NAND_FLASH_DIN_INDEX23_V << SPI_MEM_NAND_FLASH_DIN_INDEX23_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX23_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX23_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX23 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 23.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX23    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX23_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX23_V << SPI_MEM_NAND_FLASH_ADDR_INDEX23_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX23_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX23_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG23 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 23. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG23    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG23_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG23_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG23_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG23_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG23_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX23 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 23. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX23    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX23_M  (SPI_MEM_NAND_FLASH_CMD_INDEX23_V << SPI_MEM_NAND_FLASH_CMD_INDEX23_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX23_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX23_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ24_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ24_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2e0)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 24.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN24 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 24. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN24    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN24_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN24_V << SPI_MEM_NAND_FLASH_SR_CHK_EN24_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN24_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN24_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX24 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 24.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX24    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX24_M  (SPI_MEM_NAND_FLASH_DIN_INDEX24_V << SPI_MEM_NAND_FLASH_DIN_INDEX24_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX24_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX24_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX24 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 24.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX24    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX24_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX24_V << SPI_MEM_NAND_FLASH_ADDR_INDEX24_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX24_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX24_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG24 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 24. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG24    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG24_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG24_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG24_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG24_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG24_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX24 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 24. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX24    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX24_M  (SPI_MEM_NAND_FLASH_CMD_INDEX24_V << SPI_MEM_NAND_FLASH_CMD_INDEX24_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX24_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX24_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ25_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ25_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2e4)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 25.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN25 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 25. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN25    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN25_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN25_V << SPI_MEM_NAND_FLASH_SR_CHK_EN25_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN25_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN25_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX25 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 25.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX25    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX25_M  (SPI_MEM_NAND_FLASH_DIN_INDEX25_V << SPI_MEM_NAND_FLASH_DIN_INDEX25_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX25_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX25_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX25 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 25.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX25    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX25_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX25_V << SPI_MEM_NAND_FLASH_ADDR_INDEX25_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX25_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX25_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG25 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 25. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG25    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG25_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG25_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG25_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG25_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG25_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX25 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 25. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX25    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX25_M  (SPI_MEM_NAND_FLASH_CMD_INDEX25_V << SPI_MEM_NAND_FLASH_CMD_INDEX25_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX25_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX25_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ26_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ26_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2e8)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 26.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN26 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 26. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN26    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN26_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN26_V << SPI_MEM_NAND_FLASH_SR_CHK_EN26_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN26_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN26_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX26 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 26.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX26    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX26_M  (SPI_MEM_NAND_FLASH_DIN_INDEX26_V << SPI_MEM_NAND_FLASH_DIN_INDEX26_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX26_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX26_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX26 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 26.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX26    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX26_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX26_V << SPI_MEM_NAND_FLASH_ADDR_INDEX26_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX26_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX26_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG26 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 26. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG26    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG26_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG26_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG26_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG26_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG26_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX26 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 26. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX26    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX26_M  (SPI_MEM_NAND_FLASH_CMD_INDEX26_V << SPI_MEM_NAND_FLASH_CMD_INDEX26_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX26_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX26_S  11

