espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_SPI_SEQ27_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ27_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2ec)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 27.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN27 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 27. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN27    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN27_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN27_V << SPI_MEM_NAND_FLASH_SR_CHK_EN27_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN27_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN27_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX27 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 27.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX27    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX27_M  (SPI_MEM_NAND_FLASH_DIN_INDEX27_V << SPI_MEM_NAND_FLASH_DIN_INDEX27_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX27_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX27_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX27 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 27.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX27    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX27_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX27_V << SPI_MEM_NAND_FLASH_ADDR_INDEX27_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX27_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX27_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG27 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 27. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG27    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG27_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG27_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG27_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG27_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG27_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX27 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 27. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX27    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX27_M  (SPI_MEM_NAND_FLASH_CMD_INDEX27_V << SPI_MEM_NAND_FLASH_CMD_INDEX27_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX27_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX27_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ28_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ28_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2f0)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 28.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN28 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 28. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN28    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN28_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN28_V << SPI_MEM_NAND_FLASH_SR_CHK_EN28_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN28_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN28_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX28 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 28.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX28    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX28_M  (SPI_MEM_NAND_FLASH_DIN_INDEX28_V << SPI_MEM_NAND_FLASH_DIN_INDEX28_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX28_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX28_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX28 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 28.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX28    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX28_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX28_V << SPI_MEM_NAND_FLASH_ADDR_INDEX28_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX28_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX28_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG28 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 28. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG28    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG28_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG28_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG28_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG28_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG28_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX28 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 28. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX28    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX28_M  (SPI_MEM_NAND_FLASH_CMD_INDEX28_V << SPI_MEM_NAND_FLASH_CMD_INDEX28_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX28_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX28_S  11

