espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_reg.h
/** SPI_MEM_NAND_FLASH_SPI_SEQ29_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ29_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2f4)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 29.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN29 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 29. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN29    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN29_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN29_V << SPI_MEM_NAND_FLASH_SR_CHK_EN29_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN29_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN29_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX29 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 29.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX29    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX29_M  (SPI_MEM_NAND_FLASH_DIN_INDEX29_V << SPI_MEM_NAND_FLASH_DIN_INDEX29_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX29_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX29_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX29 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 29.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX29    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX29_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX29_V << SPI_MEM_NAND_FLASH_ADDR_INDEX29_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX29_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX29_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG29 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 29. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG29    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG29_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG29_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG29_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG29_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG29_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX29 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 29. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX29    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX29_M  (SPI_MEM_NAND_FLASH_CMD_INDEX29_V << SPI_MEM_NAND_FLASH_CMD_INDEX29_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX29_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX29_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ30_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ30_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2f8)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 30.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN30 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 30. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN30    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN30_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN30_V << SPI_MEM_NAND_FLASH_SR_CHK_EN30_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN30_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN30_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX30 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 30.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX30    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX30_M  (SPI_MEM_NAND_FLASH_DIN_INDEX30_V << SPI_MEM_NAND_FLASH_DIN_INDEX30_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX30_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX30_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX30 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 30.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX30    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX30_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX30_V << SPI_MEM_NAND_FLASH_ADDR_INDEX30_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX30_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX30_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG30 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 30. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG30    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG30_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG30_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG30_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG30_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG30_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX30 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 30. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX30    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX30_M  (SPI_MEM_NAND_FLASH_CMD_INDEX30_V << SPI_MEM_NAND_FLASH_CMD_INDEX30_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX30_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX30_S  11

/** SPI_MEM_NAND_FLASH_SPI_SEQ31_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_NAND_FLASH_SPI_SEQ31_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x2fc)
/** SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 31.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31    (BIT(0))
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31_M  (SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31_V << SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31_S)
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31_S  0
/** SPI_MEM_NAND_FLASH_SR_CHK_EN31 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 31. 1: enable 0: disable.
 */
#define SPI_MEM_NAND_FLASH_SR_CHK_EN31    (BIT(1))
#define SPI_MEM_NAND_FLASH_SR_CHK_EN31_M  (SPI_MEM_NAND_FLASH_SR_CHK_EN31_V << SPI_MEM_NAND_FLASH_SR_CHK_EN31_S)
#define SPI_MEM_NAND_FLASH_SR_CHK_EN31_V  0x00000001U
#define SPI_MEM_NAND_FLASH_SR_CHK_EN31_S  1
/** SPI_MEM_NAND_FLASH_DIN_INDEX31 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 31.  Use with
 *  SPI_MEM_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_NAND_FLASH_DIN_INDEX31    0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX31_M  (SPI_MEM_NAND_FLASH_DIN_INDEX31_V << SPI_MEM_NAND_FLASH_DIN_INDEX31_S)
#define SPI_MEM_NAND_FLASH_DIN_INDEX31_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_DIN_INDEX31_S  2
/** SPI_MEM_NAND_FLASH_ADDR_INDEX31 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 31.  Use with
 *  SPI_MEM_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_NAND_FLASH_ADDR_INDEX31    0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX31_M  (SPI_MEM_NAND_FLASH_ADDR_INDEX31_V << SPI_MEM_NAND_FLASH_ADDR_INDEX31_S)
#define SPI_MEM_NAND_FLASH_ADDR_INDEX31_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_ADDR_INDEX31_S  6
/** SPI_MEM_NAND_FLASH_REQ_OR_CFG31 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 31. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG31    (BIT(10))
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG31_M  (SPI_MEM_NAND_FLASH_REQ_OR_CFG31_V << SPI_MEM_NAND_FLASH_REQ_OR_CFG31_S)
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG31_V  0x00000001U
#define SPI_MEM_NAND_FLASH_REQ_OR_CFG31_S  10
/** SPI_MEM_NAND_FLASH_CMD_INDEX31 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 31. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_NAND_FLASH_CMD_INDEX31    0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX31_M  (SPI_MEM_NAND_FLASH_CMD_INDEX31_V << SPI_MEM_NAND_FLASH_CMD_INDEX31_S)
#define SPI_MEM_NAND_FLASH_CMD_INDEX31_V  0x0000000FU
#define SPI_MEM_NAND_FLASH_CMD_INDEX31_S  11

/** SPI_MEM_XTS_PLAIN_BASE_REG register
 *  The base address of the memory that stores plaintext in Manual Encryption
 */
#define SPI_MEM_XTS_PLAIN_BASE_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x300)
/** SPI_XTS_PLAIN : R/W; bitpos: [31:0]; default: 0;
 *  This field is only used to generate include file in c case. This field is useless.
 *  Please do not use this field.
 */
#define SPI_XTS_PLAIN    0xFFFFFFFFU
#define SPI_XTS_PLAIN_M  (SPI_XTS_PLAIN_V << SPI_XTS_PLAIN_S)
#define SPI_XTS_PLAIN_V  0xFFFFFFFFU
#define SPI_XTS_PLAIN_S  0

/** SPI_MEM_XTS_LINESIZE_REG register
 *  Manual Encryption Line-Size register
 */
#define SPI_MEM_XTS_LINESIZE_REG(i)          (DR_REG_SPI_MEM_BASE(i) + 0x340)
/** SPI_XTS_LINESIZE : R/W; bitpos: [1:0]; default: 0;
 *  This bits stores the line-size parameter which will be used in manual encryption
 *  calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1:
 *  32-bytes, 2: 64-bytes, 3:reserved.
 */
#define SPI_XTS_LINESIZE    0x00000003U
#define SPI_XTS_LINESIZE_M  (SPI_XTS_LINESIZE_V << SPI_XTS_LINESIZE_S)
#define SPI_XTS_LINESIZE_V  0x00000003U
#define SPI_XTS_LINESIZE_S  0

